---
kind: type
id: T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet
source: html/572d809d-fc08-6038-5279-b43903e9a6b8.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet

A set that contains TemperatureRating types.

## Syntax (C#)
```csharp
public class TemperatureRatingTypeSet : APIObject,
	IEnumerable
```